src/org/atlassian-confluence-and-jira-useing-docker-compose.org
#+TITLE: Confluence and Jira using docker-compose
#+DATE: [2021-08-17 Tue 00:31]

目录结构
#+BEGIN_EXAMPLE
.
├── confluence
│   ├── atlassian-agent.jar
│   └── Dockerfile
├── data
│   ├── confluence
│   │   ├── logs
│   │   ├── conf
│   │   └── var
│   ├── jira
│   │   ├── logs
│   │   ├── conf
│   │   └── var
│   └── mysql
│       ├── backup
│       ├── conf.d
│       │   └── my.cnf
│       └── data
├── docker-compose.yml
└── jira
    ├── atlassian-agent.jar
    └── Dockerfile
#+END_EXAMPLE

Confluence Dockerfile
#+BEGIN_EXAMPLE
FROM cptactionhank/atlassian-confluence:latest

USER root

# 将代理破解包加入容器
COPY "atlassian-agent.jar" /opt/atlassian/confluence/

# 设置启动加载代理包
RUN echo 'export CATALINA_OPTS="-javaagent:/opt/atlassian/confluence/atlassian-agent.jar ${CATALINA_OPTS}"' >> /opt/atlassian/confluence/bin/setenv.sh
#+END_EXAMPLE

Jira Dockerfile
#+BEGIN_EXAMPLE
FROM cptactionhank/atlassian-jira-software:latest

USER root

# 将代理破解包加入容器
COPY "atlassian-agent.jar" /opt/atlassian/jira/

# 设置启动加载代理包
RUN echo 'export CATALINA_OPTS="-javaagent:/opt/atlassian/jira/atlassian-agent.jar ${CATALINA_OPTS}"' >> /opt/atlassian/jira/bin/setenv.sh
#+END_EXAMPLE

MYSQL my.cnf
#+BEGIN_EXAMPLE
[mysqld]
default-storage-engine=INNODB
character_set_server=utf8mb4
innodb_default_row_format=DYNAMIC
innodb_large_prefix=ON
innodb_file_format=Barracuda
innodb_log_file_size=2G
transaction-isolation=READ-COMMITTED
max_allowed_packet=256M
#+END_EXAMPLE

#+BEGIN_EXAMPLE
CREATE DATABASE confluence CHARACTER SET utf8 COLLATE utf8_bin;
GRANT SELECT,INSERT,UPDATE,DELETE,CREATE,DROP,ALTER,INDEX,REFERENCES on confluence.* TO 'confluence'@'%' IDENTIFIED BY 'xxxxxxxxxxxx';
flush privileges;
 
CREATE DATABASE jira CHARACTER SET utf8mb4 COLLATE utf8mb4_bin;
GRANT SELECT,INSERT,UPDATE,DELETE,CREATE,DROP,ALTER,INDEX,REFERENCES on jira.* TO 'jira'@'%' IDENTIFIED BY 'xxxxxxxxxxxx';
flush privileges;
#+END_EXAMPLE

破解文件
[[../../resource/atlassian-agent-v1.2.3.zip][download]]

破解
#+BEGIN_EXAMPLE
java -jar atlassian-agent.jar -d -m foo@example.com -n xxxx -p conf -o http://127.0.0.1 -s xxxx-xxxx-xxxx-xxxx
java -jar atlassian-agent.jar -d -m foo@example.com -n xxxx -p jira -o http://127.0.0.1 -s xxxx-xxxx-xxxx-xxxx
#+END_EXAMPLE

插件破解
#+BEGIN_EXAMPLE
docker exec mbs_jira java -jar /opt/atlassian/jira/atlassian-agent.jar -p <App Key> -m a@b.com -n a@b.com -o http://127.0.0.1:8080 -s XXXX-XXXX-XXXX-XXXX
#+END_EXAMPLE


docker-compose.yml 
#+BEGIN_EXAMPLE
version: '3.8'
services:

  mysql:
    image: mysql:5.7
    container_name: mbs_mysql
    restart: always
    networks:
      - mbs-net
    environment:
      - MYSQL_ROOT_PASSWORD=UR329Tgj9gf2KhmEh3
    volumes:
      - ./data/mysql/data:/var/lib/mysql/
      - ./data/mysql/conf.d/:/etc/mysql/conf.d/
      - ./data/mysql/backup/:/backup/

  jira:
    build: ./jira
    container_name: mbs_jira
    environment:
      - TZ='Asia/Shanghai'
    restart: always
    networks:
      - mbs-net
    ports:
      - '8080:8080'
    volumes:
        - ./data/jira/var/:/var/atlassian/jira/
        - ./data/jira/logs/:/opt/atlassian/jira/logs/
        - ./data/jira/conf/:/opt/atlassian/jira/conf/
    depends_on:
      - mysql

  confluence:
    build: ./confluence
    container_name: mbs_confluence
    environment:
      - TZ='Asia/Shanghai'
    restart: always
    networks:
      - mbs-net
    ports:
      - '8090:8090'
      - '8091:8091'
    volumes:
      - ./data/confluence/var/:/var/atlassian/confluence/
      - ./data/confluence/logs/:/opt/atlassian/confluence/logs/
      - ./data/confluence/conf/:/opt/atlassian/confluence/conf/
    depends_on:
      - mysql


networks:
  mbs-net:
    driver: bridge
#+END_EXAMPLE

Reference:
+ [[https://heimo-he.github.io/docker/2020/09/22/docker-compose-gitlab-jira-confluence/][Docker compose构建Gitlab Jira Confluence及破解]]
+ [[https://community.atlassian.com/t5/Jira-articles/Running-Atlassian-server-product-on-Docker/ba-p/1209665][Running Atlassian server product on Docker]]
+ [[https://github.com/aladdinding/Confluence-and-Jira][Confluence-and-Jira]]
+ [[https://xiexinyang.gitee.io/post/docker-compose-install-confluence/][Docker-Compose安装Confluence破解版]]
+ [[https://wiki.liutyi.info/display/DEVOPS/Attlassian+Confluence+using+docker-compose][Atlassian Confluence using docker compose]]
+ [[https://github.com/seymer/confluence][Confluence and PostgreSQL]]
