blog/atlassian-confluence-and-jira-useing-docker-compose.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Confluence and Jira using docker-compose</title>
<!-- 2021-08-17 Tue 12:02 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">Confluence and Jira using docker-compose</h1>
<p>
目录结构
</p>
<pre class="example">
.
├── confluence
│   ├── atlassian-agent.jar
│   └── Dockerfile
├── data
│   ├── confluence
│   │   ├── logs
│   │   ├── conf
│   │   └── var
│   ├── jira
│   │   ├── logs
│   │   ├── conf
│   │   └── var
│   └── mysql
│       ├── backup
│       ├── conf.d
│       │   └── my.cnf
│       └── data
├── docker-compose.yml
└── jira
    ├── atlassian-agent.jar
    └── Dockerfile
</pre>

<p>
Confluence Dockerfile
</p>
<pre class="example">
FROM cptactionhank/atlassian-confluence:latest

USER root

# 将代理破解包加入容器
COPY "atlassian-agent.jar" /opt/atlassian/confluence/

# 设置启动加载代理包
RUN echo 'export CATALINA_OPTS="-javaagent:/opt/atlassian/confluence/atlassian-agent.jar ${CATALINA_OPTS}"' &gt;&gt; /opt/atlassian/confluence/bin/setenv.sh
</pre>

<p>
Jira Dockerfile
</p>
<pre class="example">
FROM cptactionhank/atlassian-jira-software:latest

USER root

# 将代理破解包加入容器
COPY "atlassian-agent.jar" /opt/atlassian/jira/

# 设置启动加载代理包
RUN echo 'export CATALINA_OPTS="-javaagent:/opt/atlassian/jira/atlassian-agent.jar ${CATALINA_OPTS}"' &gt;&gt; /opt/atlassian/jira/bin/setenv.sh
</pre>

<p>
MySQL my.cnf
</p>
<pre class="example">
[mysqld]
default-storage-engine=INNODB
character_set_server=utf8mb4
innodb_default_row_format=DYNAMIC
innodb_large_prefix=ON
innodb_file_format=Barracuda
innodb_log_file_size=2G
transaction-isolation=READ-COMMITTED
max_allowed_packet=256M
</pre>

<pre class="example">
CREATE DATABASE confluence CHARACTER SET utf8 COLLATE utf8_bin;
GRANT SELECT,INSERT,UPDATE,DELETE,CREATE,DROP,ALTER,INDEX,REFERENCES on confluence.* TO 'confluence'@'%' IDENTIFIED BY 'xxxxxxxxxxxx';
flush privileges;
 
CREATE DATABASE jira CHARACTER SET utf8mb4 COLLATE utf8mb4_bin;
GRANT SELECT,INSERT,UPDATE,DELETE,CREATE,DROP,ALTER,INDEX,REFERENCES on jira.* TO 'jira'@'%' IDENTIFIED BY 'xxxxxxxxxxxx';
flush privileges;
</pre>

<p>
破解
</p>
<pre class="example">
java -jar atlassian-agent.jar -d -m foo@example.com -n xxxx -p conf -o http://127.0.0.1 -s xxxx-xxxx-xxxx-xxxx
java -jar atlassian-agent.jar -d -m foo@example.com -n xxxx -p jira -o http://127.0.0.1 -s xxxx-xxxx-xxxx-xxxx
</pre>

<p>
插件破解
</p>
<pre class="example">
docker exec mbs_jira java -jar /opt/atlassian/jira/atlassian-agent.jar -p &lt;App Key&gt; -m a@b.com -n a@b.com -o http://127.0.0.1:8080 -s XXXX-XXXX-XXXX-XXXX
</pre>


<p>
docker-compose.yml 
</p>
<pre class="example">
version: '3.8'
services:

  mysql:
    image: mysql:5.7
    container_name: mbs_mysql
    restart: always
    networks:
      - mbs-net
    environment:
      - MYSQL_ROOT_PASSWORD=UR329Tgj9gf2KhmEh3
    volumes:
      - ./data/mysql/data:/var/lib/mysql/
      - ./data/mysql/conf.d/:/etc/mysql/conf.d/
      - ./data/mysql/backup/:/backup/

  jira:
    build: ./jira
    container_name: mbs_jira
    environment:
      - TZ='Asia/Shanghai'
    restart: always
    networks:
      - mbs-net
    ports:
      - '8080:8080'
    volumes:
        - ./data/jira/var/:/var/atlassian/jira/
        - ./data/jira/logs/:/opt/atlassian/jira/logs/
    depends_on:
      - mysql

  confluence:
    build: ./confluence
    container_name: mbs_confluence
    environment:
      - TZ='Asia/Shanghai'
    restart: always
    networks:
      - mbs-net
    ports:
      - '8090:8090'
      - '8091:8091'
    volumes:
      - ./data/confluence/var/:/var/atlassian/confluence/
      - ./data/confluence/logs/:/opt/atlassian/confluence/logs/
    depends_on:
      - mysql


networks:
  mbs-net:
    driver: bridge
</pre>

<p>
Reference:
</p>
<ul class="org-ul">
<li><a href="https://heimo-he.github.io/docker/2020/09/22/docker-compose-gitlab-jira-confluence/">Docker compose构建Gitlab Jira Confluence及破解</a>
</li>
<li><a href="https://community.atlassian.com/t5/Jira-articles/Running-Atlassian-server-product-on-Docker/ba-p/1209665">Running Atlassian server product on Docker</a>
</li>
<li><a href="https://github.com/aladdinding/Confluence-and-Jira">Confluence-and-Jira</a>
</li>
<li><a href="https://xiexinyang.gitee.io/post/docker-compose-install-confluence/">Docker-Compose安装Confluence破解版</a>
</li>
<li><a href="https://wiki.liutyi.info/display/DEVOPS/Attlassian+Confluence+using+docker-compose">Atlassian Confluence using docker compose</a>
</li>
<li><a href="https://github.com/seymer/confluence">Confluence and PostgreSQL</a>
</li>
<li><a href="../../resource/atlassian-agent-v1.2.3.zip">atlassian-agent破解包下载</a>
</li>
</ul>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>